Cough/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include           "$FOAM_CASE/system/controlDict"
tb1   5;
td1   2.7;
tb2   #calc "$tb1 + $td1";
td2   0.5;
tb3   #calc "$tb2 + $td2";
td3   #calc "$endTime - $tb3";

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;

    maxCo           1.0;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
    }

    averagingMethod dual;

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U           semiImplicit 1;
        }
    }
}

constantProperties
{
  rho0            1000;
  alphaMax        0.60;
}

subModels
{
    particleForces
    {
      sphereDrag//ErgunWenYuDrag
        {
	  alphac alpha.air;
        }
        gravity;
    }

    injectionModels
    {
		
		model2
        {
            type            patchFlowRateInjection; //patchInjection
            patchName       MOUTH3;
            phi             phi.air;
            massTotal       0.01;
            concentration   5000000;
            SOI             $tb2;  //start of injection
            duration        $td2;
            //U0              (0 $vb1 0);
            //flowRateProfile 0.01;

            parcelBasisType number;  //mass;
            nParticles      1;
            parcelConcentration   1;
            parcelsPerSecond 20000;
			
            sizeDistribution
            {
                type        general;
                generalDistribution
                {
		  distribution
			(
				(1.36257E-06	0.002891895)
				(1.57939E-06	0.020569912)
				(1.85919E-06	0.050686669)
				(2.17006E-06	0.115024909)
				(2.53224E-06	0.162699793)
				(2.95425E-06	0.206901944)
				(3.41819E-06	0.16700498)
				(3.98659E-06	0.129555368)
				(4.64873E-06	0.073432775)
				(5.46395E-06	0.043333973)
				(6.31801E-06	0.019448249)
				(7.36323E-06	0.006594576)
				(8.57995E-06	0.001854957)
			 );
                }
            }
        }	
		
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            "(WALL_BACK|WALL_BOTTOM|WALL_FRONT|WALL_LEFT|WALL_RIGHT|WALL_TOP)"
            {
                type stick;
                e    0.97;
                mu   0.09;
            }

            "(MOUTH1|MOUTH2|MOUTH3|MOUTH4|MOUTH5|MOUTH6)"
            {
                type stick;
                e    0.97;
                mu   0.09;
            }

            "(NOSE1|NOSE2|NOSE3|NOSE4|NOSE5|NOSE6)"
            {
                type stick;
                e    0.97;
                mu   0.09;
            }

            "(PASSENGER1|PASSENGER2|PASSENGER3|PASSENGER4|PASSENGER5|PASSENGER6)"
            {
                type stick;
                e    0.97;
                mu   0.09;
            }
			
            "(HEAD1|HEAD2|HEAD3|HEAD4|HEAD5|HEAD6)"
            {
                type stick;
                e    0.97;
                mu   0.09;
            }

            VENT1
            {
                type escape;
            }

            VENT2    
            {
                type escape;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel implicit;//none;

   explicitCoeffs
    {
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.6;
            pSolid 10.0;
            beta 2.0;
            eps 1.0e-7;
        }
        correctionLimitingMethod
        {
            type absolute;
            e 0.9;
        }
    }

    implicitCoeffs
    {
        alphaMin 0.0001;
        rhoMin 1.0;
        applyLimiting true;
        applyGravity false;
        particleStressModel
        {
            type HarrisCrighton;
            alphaPacked 0.6;
            pSolid 5.0;
            beta 2.0;
            eps 1.0e-2;
        }
    }

    dampingModel none;

    isotropyModel stochastic;

    stochasticCoeffs
    {
        timeScaleModel
        {
            type isotropic;
            alphaPacked 0.6;
            e 0.9;
        }
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}


// ************************************************************************* //
